// 休日を定義する必要がある。将来的にはバックエンドのDBへ持つ。
//   1. DBに持つ
//   2. ファイルに持つ or ソース上に定義
final Map<DateTime, List> _holidays = {
  DateTime(2021, 1, 1): ['元旦'],
  DateTime(2021, 1, 11): ['成人の日'],
  DateTime(2021, 2, 11): ['建国記念の日'],
  DateTime(2021, 2, 23): ['天皇誕生日'],
  DateTime(2021, 3, 20): ['春分の日'],
  DateTime(2021, 4, 29): ['昭和の日'],
  DateTime(2021, 5, 3): ['憲法記念日'],
  DateTime(2021, 5, 4): ['みどりの日'],
  DateTime(2021, 5, 5): ['こどもの日'],
  DateTime(2021, 7, 22): ['海の日'],
  DateTime(2021, 7, 23): ['スポーツの日'],
  DateTime(2021, 8, 8): ['山の日'],
  DateTime(2021, 8, 9): ['振替休日'],
  DateTime(2021, 9, 20): ['敬老の日'],
  DateTime(2021, 9, 23): ['秋分の日'],
};
